Revit 2027 API
IFCData.AsBoolean Method
 Gets storage value as boolean when its PrimitiveType is boolean.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool AsBoolean()
Public Function AsBoolean As Boolean
public:
bool AsBoolean()
member AsBoolean : unit -> bool
Return Value
Boolean
 The bool value.
Exceptions
Exception | Condition
InapplicableDataException |  The primitive type is not boolean.
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace